{"format":"layers-model","generatedBy":"TensorFlow 2.20.0 / Keras","convertedBy":"Fire Evacuation AI direct TFJS exporter 1.0","modelTopology":{"module":"keras","class_name":"Sequential","config":{"name":"fire_prediction_30s","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"layers":[{"module":"keras.layers","class_name":"InputLayer","config":{"batch_shape":[null,30],"dtype":"float32","sparse":false,"ragged":false,"name":"sensor_input","optional":false},"registered_name":null},{"module":"keras.layers","class_name":"Dense","config":{"name":"dense_1","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":64,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"quantization_config":null},"registered_name":null,"build_config":{"input_shape":[null,30]}},{"module":"keras.layers","class_name":"Dense","config":{"name":"dense_2","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":64,"activation":"relu","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"quantization_config":null},"registered_name":null,"build_config":{"input_shape":[null,64]}},{"module":"keras.layers","class_name":"Dense","config":{"name":"future_sensor_output","trainable":true,"dtype":{"module":"keras","class_name":"DTypePolicy","config":{"name":"float32"},"registered_name":null},"units":30,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"module":"keras.initializers","class_name":"GlorotUniform","config":{"seed":null},"registered_name":null},"bias_initializer":{"module":"keras.initializers","class_name":"Zeros","config":{},"registered_name":null},"kernel_regularizer":null,"bias_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"quantization_config":null},"registered_name":null,"build_config":{"input_shape":[null,64]}}],"build_input_shape":[null,30]},"registered_name":null,"build_config":{"input_shape":[null,30]},"compile_config":{"optimizer":{"module":"keras.optimizers","class_name":"Adam","config":{"name":"adam","learning_rate":0.0002500000118743628,"weight_decay":null,"clipnorm":null,"global_clipnorm":null,"clipvalue":null,"use_ema":false,"ema_momentum":0.99,"ema_overwrite_frequency":null,"loss_scale_factor":null,"gradient_accumulation_steps":null,"beta_1":0.9,"beta_2":0.999,"epsilon":1e-07,"amsgrad":false},"registered_name":null},"loss":"mse","loss_weights":null,"metrics":["mae"],"weighted_metrics":null,"run_eagerly":false,"steps_per_execution":1,"jit_compile":true}},"weightsManifest":[{"paths":["group1-shard1of1.bin"],"weights":[{"name":"dense_1/kernel","shape":[30,64],"dtype":"float32"},{"name":"dense_1/bias","shape":[64],"dtype":"float32"},{"name":"dense_2/kernel","shape":[64,64],"dtype":"float32"},{"name":"dense_2/bias","shape":[64],"dtype":"float32"},{"name":"future_sensor_output/kernel","shape":[64,30],"dtype":"float32"},{"name":"future_sensor_output/bias","shape":[30],"dtype":"float32"}]}]}